if {![namespace exists ::IMEX]} { namespace eval ::IMEX {} }
set ::IMEX::dataVar [file dirname [file normalize [info script]]]
set ::IMEX::libVar ${::IMEX::dataVar}/libs

create_library_set -name timing_lib1\
   -timing\
    [list ${::IMEX::libVar}/mmmc/slow.lib]
create_rc_corner -name default_rc_corner\
   -preRoute_res 1\
   -postRoute_res 1\
   -preRoute_cap 1\
   -postRoute_cap 1\
   -postRoute_xcap 1\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_delay_corner -name delay1\
   -early_library_set timing_lib1\
   -late_library_set timing_lib1
create_constraint_mode -name sdc1\
   -sdc_files\
    [list ${::IMEX::libVar}/mmmc/cac_constraints_medium_c_scan.sdc]
create_analysis_view -name view1 -constraint_mode sdc1 -delay_corner delay1
set_analysis_view -setup [list view1] -hold [list view1]
