
Cadence Tempus(TM) Timing Signoff Solution.
Copyright 2020 Cadence Design Systems, Inc. All rights reserved worldwide.

Version:	v20.10-p003_1, built Wed Apr 29 15:56:37 PDT 2020
Options:	-nowin 
Date:		Sat Oct 11 05:12:21 2025
Host:		edatools-server2.iiitd.edu.in (x86_64 w/Linux 2.6.32-754.35.1.el6.x86_64) (18cores*72cpus*Intel(R) Xeon(R) Gold 6354 CPU @ 3.00GHz 39936KB)
OS:		Red Hat Enterprise Linux Server release 6.10 (Santiago)

License:
		tpsxl	Tempus Timing Signoff Solution XL	20.1	checkout succeeded
		16 CPU jobs allowed with the current license(s). Use set_multi_cpu_usage to set your required CPU count.
Change the soft stacksize limit to 0.2%RAM (1033 mbytes). Set global soft_stack_size_limit to change the value.
environment variable TMPDIR is '/tmp/ssv_tmpdir_27913_bk0vFa'.
<CMD> read_lib ../../LIB/slow.lib
<CMD> read_verilog ../../DFT/medium_c/reports/cac_netlist_medium_c_scan.v
<CMD> set_top_module collision_avoidance_car
#% Begin Load MMMC data ... (date=10/11 05:13:24, mem=428.1M)
Number of views requested 1 are allowed with the current licenses... continuing with set_analysis_view.
#% End Load MMMC data ... (date=10/11 05:13:24, total cpu=0:00:00.0, real=0:00:00.0, peak res=428.3M, current mem=428.3M)
default_emulate_early_rc_corner default_emulate_late_rc_corner default_emulate_rc_corner
Loading view definition file from .ssv_emulate_view_definition_27913.tcl
Reading default_emulate_libset_max timing library '/home/sameer25145/Desktop/CAC_Project/LIB/slow.lib' ...
Read 479 cells in library 'slow' 
*** End library_loading (cpu=0.01min, real=0.02min, mem=16.0M, fe_cpu=0.13min, fe_real=1.07min, fe_mem=563.5M) ***
#% Begin Load netlist data ... (date=10/11 05:13:25, mem=433.6M)
*** Begin netlist parsing (mem=563.5M) ***
Reading verilog netlist '../../DFT/medium_c/reports/cac_netlist_medium_c_scan.v'

*** Memory Usage v#1 (Current mem = 715.539M, initial mem = 273.305M) ***
*** End netlist parsing (cpu=0:00:00.0, real=0:00:00.0, mem=715.5M) ***
#% End Load netlist data ... (date=10/11 05:13:25, total cpu=0:00:00.2, real=0:00:00.0, peak res=539.0M, current mem=531.0M)
Set top cell to collision_avoidance_car.
Starting consistency checks on late and early library sets of delay corner 'default_emulate_delay_corner'
late library set: default_emulate_libset_max
early library set: default_emulate_libset_min
Completed consistency checks. Status: Successful
Starting consistency checks on late and early library sets of delay corner 'default_emulate_delay_corner'
late library set: default_emulate_libset_max
early library set: default_emulate_libset_min
Completed consistency checks. Status: Successful
Building hierarchical netlist for Cell collision_avoidance_car ...
*** Netlist is unique.
** info: there are 483 modules.
** info: there are 791 stdCell insts.

*** Memory Usage v#1 (Current mem = 929.492M, initial mem = 273.305M) ***
Set Default Net Delay as 1000 ps.
Set Default Net Load as 0.5 pF. 
Set Default Input Pin Transition as 0.1 ps.
/dev/null
Extraction setup Started 
Summary of Active RC-Corners : 
 
 Analysis View: default_emulate_view
    RC-Corner Name        : default_emulate_rc_corner
    RC-Corner Index       : 0
    RC-Corner Temperature : 25 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PostRoute Res Factor        : 1
    RC-Corner PostRoute Cap Factor        : 1
    RC-Corner PostRoute XCap Factor       : 1
Starting consistency checks on late and early library sets of delay corner 'default_emulate_delay_corner'
late library set: default_emulate_libset_max
early library set: default_emulate_libset_min
Completed consistency checks. Status: Successful
Reading timing constraints file '/dev/null' ...
Current (total cpu=0:00:08.6, real=0:01:04, peak res=838.6M, current mem=838.6M)
Total number of combinational cells: 316
Total number of sequential cells: 152
Total number of tristate cells: 10
Total number of level shifter cells: 0
Total number of power gating cells: 0
Total number of isolation cells: 0
Total number of power switch cells: 0
Total number of pulse generator cells: 0
Total number of always on buffers: 0
Total number of retention cells: 0
List of usable buffers: BUFX12 BUFX16 BUFX2 BUFX20 BUFX3 BUFX4 BUFX6 BUFX8 CLKBUFX12 CLKBUFX16 CLKBUFX2 CLKBUFX20 CLKBUFX3 CLKBUFX4 CLKBUFX6 CLKBUFX8
Total number of usable buffers: 16
List of unusable buffers:
Total number of unusable buffers: 0
List of usable inverters: CLKINVX1 CLKINVX12 CLKINVX16 CLKINVX2 CLKINVX20 CLKINVX3 CLKINVX4 CLKINVX6 CLKINVX8 INVX1 INVX12 INVX16 INVX2 INVX20 INVX3 INVX4 INVX6 INVXL INVX8
Total number of usable inverters: 19
List of unusable inverters:
Total number of unusable inverters: 0
List of identified usable delay cells: DLY1X1 DLY1X4 DLY2X1 DLY2X4 DLY3X1 DLY3X4 DLY4X4 DLY4X1
Total number of identified usable delay cells: 8
List of identified unusable delay cells:
Total number of identified unusable delay cells: 0
default_emulate_constraint_mode
Extraction setup Started 
Summary of Active RC-Corners : 
 
 Analysis View: default_emulate_view
    RC-Corner Name        : default_emulate_rc_corner
    RC-Corner Index       : 0
    RC-Corner Temperature : 125 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PostRoute Res Factor        : 1
    RC-Corner PostRoute Cap Factor        : 1
    RC-Corner PostRoute XCap Factor       : 1
Extraction setup Started 
Summary of Active RC-Corners : 
 
 Analysis View: default_emulate_view
    RC-Corner Name        : default_emulate_rc_corner
    RC-Corner Index       : 0
    RC-Corner Temperature : 125 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PostRoute Res Factor        : 1
    RC-Corner PostRoute Cap Factor        : 1
    RC-Corner PostRoute XCap Factor       : 1
Extraction setup Started 
Summary of Active RC-Corners : 
 
 Analysis View: default_emulate_view
    RC-Corner Name        : default_emulate_rc_corner
    RC-Corner Index       : 0
    RC-Corner Temperature : 125 Celsius
    RC-Corner Cap Table   : ''
    RC-Corner PostRoute Res Factor        : 1
    RC-Corner PostRoute Cap Factor        : 1
    RC-Corner PostRoute XCap Factor       : 1
default_emulate_libset_max default_emulate_libset_min
<CMD> create_clock -name "clk" -period 15 [get_ports clk]
<CMD> set_clock_latency 0.25 [get_clocks clk]
<CMD> set_clock_transition 0.2 -rise [get_clocks clk]
<CMD> set_clock_transition 0.2 -fall [get_clocks clk]
<CMD> set_clock_uncertainty 0.1 [get_clocks clk]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports rst]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports front_obstacle_detected]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports left_obstacle_detected]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports right_obstacle_detected]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports front_obstacle_slow]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports lane_clear_left]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports lane_clear_right]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports destination_reached]
<CMD> set_input_delay 0.4 -clock [get_clocks clk] [get_ports {speed_limit_zone[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {acceleration[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {steering[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {indicators[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {current_speed_out[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {distance_travelled_out[*]}]
<CMD> set_output_delay 0.2 -clock [get_clocks clk] [get_ports {total_power_consumed_out[*]}]
<CMD> set_propagated_clock [all_clocks]
**WARN: (TCLCMD-1126):	Clock object 'clk' converted from ideal to propagated mode
<CMD> set_case_analysis 0 [get_ports rst]
<CMD> set_case_analysis 0 [get_ports test_mode]
<CMD> set_case_analysis 0 [get_ports scan_en]
<CMD> update_timing
**WARN: (IMPESI-3468):	User needs to specify -equivalent_waveform_model propagation first before specifying -waveform_compression_mode accurate|clock_detailed .
AAE DB initialization (MEM=1109.25 CPU=0:00:00.0 REAL=0:00:00.0) 
#################################################################################
# Design Name: collision_avoidance_car
# Design Mode: 65nm
# Analysis Mode: MMMC OCV 
# Parasitics Mode: No SPEF/RCDB
# Signoff Settings: SI Off 
#################################################################################
Start delay calculation (fullDC) (1 T). (MEM=965.254)
/dev/null
End delay calculation. (MEM=987.547 CPU=0:00:00.1 REAL=0:00:00.0)
End delay calculation (fullDC). (MEM=979.547 CPU=0:00:00.2 REAL=0:00:00.0)
<CMD> check_timing > $report_dir/check_timing.rpt 
<CMD> report_timing > $report_dir/timing_report.rpt
<CMD> report_timing -nworst 100 -late > $report_dir/timing_setup.rpt
<CMD> report_timing -nworst 100 -early > $report_dir/timing_hold.rpt
<CMD> report_analysis_coverage > $report_dir/analysis_coverage.rpt 
<CMD> report_analysis_summary > $report_dir/analysis_summary.rpt 
<CMD> report_clocks > $report_dir/clocks.rpt 
<CMD> report_case_analysis > $report_dir/case_analysis.rpt 
<CMD> report_constraints -all_violators > reports/allviolationsinit.rpt
<CMD> exit

*** Memory Usage v#1 (Current mem = 955.340M, initial mem = 273.305M) ***

*** Summary of all messages that are not suppressed in this session:
Severity  ID               Count  Summary                                  
WARNING   IMPESI-3468          1  User needs to specify -equivalent_wavefo...
WARNING   TCLCMD-1126          1  %s object '%s' converted from %s to %s m...
*** Message Summary: 2 warning(s), 0 error(s)

--- Ending "Tempus Timing Signoff Solution" (totcpu=0:00:09.6, real=0:01:05, mem=955.3M) ---
