# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.13-s073_1 on Sat Oct 11 17:25:58 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design collision_avoidance_car

create_clock -name "clk" -period 30.0 -waveform {0.0 15.0} [get_ports clk]
set_load -pin_load 1.0 [get_ports {acceleration[1]}]
set_load -pin_load 1.0 [get_ports {acceleration[0]}]
set_load -pin_load 1.0 [get_ports {steering[1]}]
set_load -pin_load 1.0 [get_ports {steering[0]}]
set_load -pin_load 1.0 [get_ports {indicators[1]}]
set_load -pin_load 1.0 [get_ports {indicators[0]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[7]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[6]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[5]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[4]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[3]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[2]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[1]}]
set_load -pin_load 1.0 [get_ports {current_speed_out[0]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[31]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[30]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[29]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[28]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[27]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[26]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[25]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[24]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[23]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[22]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[21]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[20]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[19]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[18]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[17]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[16]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[15]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[14]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[13]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[12]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[11]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[10]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[9]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[8]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[7]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[6]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[5]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[4]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[3]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[2]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[1]}]
set_load -pin_load 1.0 [get_ports {distance_travelled_out[0]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[31]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[30]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[29]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[28]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[27]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[26]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[25]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[24]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[23]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[22]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[21]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[20]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[19]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[18]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[17]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[16]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[15]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[14]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[13]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[12]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[11]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[10]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[9]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[8]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[7]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[6]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[5]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[4]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[3]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[2]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[1]}]
set_load -pin_load 1.0 [get_ports {total_power_consumed_out[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports front_obstacle_detected]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports left_obstacle_detected]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports right_obstacle_detected]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports front_obstacle_slow]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports lane_clear_left]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports lane_clear_right]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports destination_reached]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports {speed_limit_zone[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.4 [get_ports {speed_limit_zone[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {acceleration[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {acceleration[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {steering[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {steering[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {indicators[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {indicators[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {current_speed_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {distance_travelled_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {total_power_consumed_out[0]}]
set_wire_load_mode "enclosed"
